# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

a = float(input('введите первое число: '))
b = float(input('введите второе число: '))

print(a + b)  # сумма чисел
print(a - b)  # разность чисел
print(a * b)  # произведение чисел
