# Даны действительные числа x и y.

x = float(input('введите первое число x: '))
y = float(input('введите второе число y: '))

print((abs(x)-abs(y))/(1+abs(x*y)))
