# Даны два действительных числа. Найти среднее арифметическое
# и среднее геометрическое этих чисел

a = int(input('введите первое число: '))
b = int(input('введите второе число: '))

print('Среднее арифметическое равно: ', (a+b)/2)

print('Среднее геометрическое равно: ', (a*b)**0.5)